<template>
  <div class="privacy-policy">
    <Header :hide-menu="true" />
    <v-container class="container">
      <div class="privacy-policy-content">
        <h1>Политика конфиденциальности SlicerTok</h1>
        <p>
          Настоящая Политика конфиденциальности (далее — «Политика») регулирует порядок сбора,
          использования, хранения, передачи и защиты персональных данных Пользователей Платформы
          SlicerTok
        </p>
        <h3>1. Определения</h3>
        <p>
          Персональные данные — любая информация, прямо или косвенно относящаяся к идентифицируемому
          лицу.
        </p>
        <p>
          Обработка — любые действия с персональными данными, включая сбор, хранение, анализ,
          передачу.
        </p>
        <p>Оператор данных — лицо, определяющее цели и способы обработки данных.</p>
        <p>Третьи лица — сервис-провайдеры, подрядчики, блогеры, государственные органы.</p>
        <h3>2. Правовые основания обработки</h3>
        <p>Мы обрабатываем персональные данные на основании:</p>
        <p>1. Согласия субъекта</p>
        <p>2. Исполнения договора — для обеспечения доступа к функционалу Платформы</p>
        <p>3. Легитимного интереса — предотвращение мошенничества, улучшение сервиса</p>
        <p>4. Требований закона — хранение данных, предоставление информации госорганам</p>
        <p>5. Выполнения публичных обязанностей, если применимо</p>
        <h3>3. Перечень обрабатываемых данных</h3>
        <p>3.1. Данные, предоставленные Пользователем</p>
        <ul>
          имя, никнейм; контактная информация (email, телефон); ссылки на социальные профили; данные
          заявок (ссылки, статистика); фотографии, аватары (если загрузка доступна); переписка с
          поддержкой.
        </ul>
      </div>
    </v-container>
    <Footer />
  </div>
</template>

<script setup lang="ts">
import Footer from '@/components/landing/Footer.vue'
import Header from '@/components/landing/Header.vue'
</script>

<style scoped lang="scss">
.privacy-policy {
  background: #fff;
}
</style>
